<a href="https://colab.research.google.com/github/s23912/pad_practicals/blob/main/PAD_LAB_02_ZADANIE_DOMOWE_pawel_ungier_update.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Pawel Ungier [s23912] 
#Zadanie domowe PAD_LAB_02

In [ ]:
# PRESTEPS (import, usuwanie wartości na )
import pandas as pd
path = '/content/drive/MyDrive/DS/PAD/PAD_02/ZADANIE_DOMOWE/PAD_02_PD.csv'
df = pd.read_csv(path, sep=';') #importing
df.head()

   ID Country  owns_car  owns_TV  owns_house  owns_Phone gender  Age
0   1       A       0.0      0.0         0.0           1      M   61
1   2       B       0.0      0.0         0.0           1      M   44
2   3       A       0.0      0.0         0.0           1      M   56
3   4       A       0.0      0.0         0.0           1      M   53
4   5       C       1.0      1.0         0.0           1      K   60

In [ ]:
#Preparation of data (usuwanie wartości na )
print('All not complete rows: ',df.isnull().any(axis = 1).sum()) #sprawdzamy ile jest wartości na

All not complete rows:  22

In [ ]:
#Missing data - sprawdzamy jakich wartości brakuje
print('Missing ID :',df['ID'].isnull().sum())
print('Missing Country :',df['Country'].isnull().sum())
print('Missing cars :',df['owns_car'].isnull().sum())
print('Missing TV:',df['owns_TV'].isnull().sum())
print('Missing houses :',df['owns_house'].isnull().sum())
print('Missing phones:',df['owns_Phone'].isnull().sum())
print('Missing gender:',df['gender'].isnull().sum())
print('Missing age:',df['Age'].isnull().sum())

Missing ID : 0
Missing Country : 7
Missing cars : 2
Missing TV: 2
Missing houses : 6
Missing phones: 0
Missing gender: 5
Missing age: 0

In [ ]:
#All rows with missing data to remove 
df[df.isnull().any(axis = 1)] # podglądamy jakich wartości brakuje

      ID Country  owns_car  owns_TV  owns_house  owns_Phone gender  Age
31    32       C       1.0      1.0         1.0           1    NaN   60
50    51       A       0.0      NaN         0.0           1      M   37
72    73       A       NaN      0.0         0.0           1      M   45
75    76       B       0.0      0.0         NaN           1      M   39
106  107       B       0.0      0.0         NaN           1      M   36
128  129       A       0.0      0.0         NaN           1      M   66
155  156       C       1.0      1.0         NaN           1      K   27
174  175       A       0.0      0.0         0.0           1    NaN   64
176  177       C       0.0      1.0         NaN           1      K   49
199  200       A       0.0      0.0         0.0           1    NaN   59
240  241       B       0.0      1.0         0.0           1    NaN   51
278  279     NaN       0.0      1.0         0.0           1      K   24
279  280     NaN       0.0      0.0         0.0           1      M   33
280  281     NaN       0.0      0.0         0.0           1      M   45
281  282     NaN       0.0      0.0         0.0           1      M   51
282  283     NaN       0.0      0.0         0.0           1      M   60
283  284     NaN       0.0      0.0         0.0           1      M   64
284  285     NaN       0.0      0.0         0.0           1      M   19
335  336       B       0.0      0.0         NaN           1      M   67
337  338       C       NaN      1.0         0.0           1      K   34
358  359       C       1.0      1.0         0.0           1    NaN   45
361  362       B       0.0      NaN         0.0           1      M   30

In [ ]:
#Usuwamy na
print('ilość wierszy przed usunięciem na: ', len(df)) 
df = df.dropna()
print('ilość wierszy po usunięciu na: ',len(df)) #powinno być o 22 mniej

ilość wierszy przed usunięciem na:  800
ilość wierszy po usunięciu na:  778

In [ ]:
#Zadanie 1: Wgraj plik DANE_PAD_02.csv jako ramkę danych. Oblicz liczebność każdej z wartości w zmiennej COUNTRY.
# Wgranie ramki danych nastapiło już w fazie zerowej przy pracach nad usuwaniem wartości na

In [ ]:
#Zadanie 1 - version1
df['Country'].value_counts()

A    323
B    196
C    181
D     78
Name: Country, dtype: int64

In [ ]:
#Zadanie 1 - version 2 - to samo zrealizowane za pomocą groupby
print(df.groupby(by='Country')['Country'].count())

Country
A    323
B    196
C    181
D     78
Name: Country, dtype: int64

In [ ]:
#Zadanie 2
#Stwórz zmienną, która będzie informowała o liczbie posiadanych dóbr
# czy zmienna to Seria danych(kolumna) sumująca wszystkie dobra czy zmienna to nowa Ramka Danych grupująca wszystkie dobra w obrębie kraju? 
#Pierwotnie zakładałem, że tą bedzie to kolumna informująca o sumie wszystkich dóbr bez grupowania po kraju
#W tym wypadku przygotowałem wersje , która grupuje posiadane dobra w danym kraju

tmp = pd.pivot_table(df,index='Country', values=['owns_car','owns_TV','owns_house','owns_Phone'])
tmp # zobaczmy jak to bedzie wyglądać proporcjonalnie

         owns_Phone   owns_TV  owns_car  owns_house
Country
A          0.860681  0.000000  0.000000    0.000000
B          1.000000  0.459184  0.000000    0.000000
C          1.000000  1.000000  0.585635    0.441989
D          1.000000  1.000000  1.000000    1.000000

In [ ]:
#Właściwy wklad do Zadania nr 2
A = df[df['Country']=='A'] #filtrujemy tylko wiersze dla kraju A
A_Car = A[A['owns_car']==1]['owns_car'].count() #zliczamy samochody dla kraju A
A_TV = A[A['owns_TV']==1]['owns_TV'].count() #zliczamy TV dla kraju A
A_House = A[A['owns_house']==1]['owns_house'].count() #zliczamy domy dla kraju A
A_Phone = A[A['owns_Phone']==1]['owns_Phone'].count() #zliczamy telefony dla kraju A

#musimy użyc metodę count() a nie sum(). Metoda count zliczy ilość wierszy, metoda sum() zawartość wierszy

B = df[df['Country']=='B'] #analogiczne działania dla B, itd
B_Car = B[B['owns_car']==1]['owns_car'].count()
B_TV = B[B['owns_TV']==1]['owns_TV'].count()
B_House = B[B['owns_house']==1]['owns_house'].count()
B_Phone = B[B['owns_Phone']==1]['owns_Phone'].count()

C = df[df['Country']=='C']
C_Car = C[C['owns_car']==1]['owns_car'].count()
C_TV = C[C['owns_TV']==1]['owns_TV'].count()
C_House = C[C['owns_house']==1]['owns_house'].count()
C_Phone = C[C['owns_Phone']==1]['owns_Phone'].count()

D = df[df['Country']=='D']
D_Car = D[D['owns_car']==1]['owns_car'].count()
D_TV = D[D['owns_TV']==1]['owns_TV'].count()
D_House = D[D['owns_house']==1]['owns_house'].count()
D_Phone = D[D['owns_Phone']==1]['owns_Phone'].count()

country_index =['A','B','C','D']
country_dic = {'owns_car':[A_Car, B_Car, C_Car, D_Car],
               'owns_TV': [A_TV, B_TV, C_TV, D_TV],
               'owns_House':[ A_House, B_House, C_House, D_House],
               'owns_Phone': [A_Phone, B_Phone, C_Phone, D_Phone]}
country_welth = pd.DataFrame(country_dic, country_index)
country_welth

   owns_car  owns_TV  owns_House  owns_Phone
A         0        0           0         278
B         0       90           0         196
C       106      181          80         181
D        78       78          78          78

In [ ]:
#robimy test czy nasze wyliczenia się zgadzają na przykładzie państwa C
C_Car1 = C[C['owns_car']==1.0]['owns_car'].count()
C_Car0 = C[C['owns_car']==0.0]['owns_car'].count()
print('ilość osób w państwie C z samochodem:', C_Car1)
print('ilość osób w państwie C bez samochodu:', C_Car0)
print('czuli razem: ',C_Car1 + C_Car0)
print('Ilość rekordów w państwie C',df[df['Country']=='C']['Country'].count())

ilość osób w państwie C z samochodem: 106
ilość osób w państwie C bez samochodu: 75
czuli razem:  181
Ilość rekordów w państwie C 181

In [ ]:
#Zadanie 3
#Porównaj średnią posiadanych dóbr między kobietami i mężczyznami

# Obliczenia dla kobiet
women = df[df['gender']=='K'] #filtrujemy tylko wiersze dla Kobiet
women_amount = df[df['gender']=='K']['gender'].count()
women_Car = women[women['owns_car']==1]['owns_car'].count() #zliczamy samochody dla kobiet
women_TV = women[women['owns_TV']==1]['owns_TV'].count() #zliczamy TV dla kobiet
women_House = women[women['owns_house']==1]['owns_house'].count() #zliczamy domy dla kobiet
women_Phone = women[women['owns_Phone']==1]['owns_Phone'].count() #zliczamy telefony dla kobiet

#Obliczenia dla mężczyzn
men = df[df['gender']=='M'] #filtrujemy tylko wiersze dla Mężczyzn
men_amount = df[df['gender']=='M']['gender'].count()
men_Car = men[men['owns_car']==1]['owns_car'].count() #zliczamy samochody dla mężczyzn
men_TV = men[men['owns_TV']==1]['owns_TV'].count() #zliczamy TV dla mężczyzn
men_House = men[men['owns_house']==1]['owns_house'].count() #zliczamy domy dla mężczyzn
men_Phone = men[men['owns_Phone']==1]['owns_Phone'].count() #zliczamy telefony dla mężczyzn

print('Liczba posiadanych dóbr na',women_amount, 'kobiet')
print('Car:',(round(women_Car/women_amount,2)*100), '%')
print('TV:',(round(women_TV/women_amount,2)*100), '%')
print('House:',(round(women_House/women_amount,2)*100), '%')
print('Phone:',(round(women_Phone/women_amount,2)*100), '%')

print('Liczba posiadanych dóbr na',men_amount, 'mężczyzn')
print('Car:',(round(men_Car/men_amount,2)*100), '%')
print('TV:',(round(men_TV/men_amount,2)*100), '%')
print('House:',(round(men_House/men_amount,2)*100), '%')
print('Phone:',(round(men_Phone/men_amount,2)*100), '%')

Liczba posiadanych dóbr na 384 kobiet
Car: 48.0 %
TV: 91.0 %
House: 41.0 %
Phone: 100.0 %
Liczba posiadanych dóbr na 394 mężczyzn
Car: 0.0 %
TV: 0.0 %
House: 0.0 %
Phone: 89.0 %

In [ ]:
#ciekawy Insight powyżej porownujący liczbę posiadanych dóbr (statystyka niestety jest bezlitosna)

In [ ]:
#Sprawdzamy jeszcze czy na pewno nie ma pomyłki
print('liczba rekordów meżczyzn posiadających samochód:', len(men[men['owns_car']==1]))
print('liczba rekordów meżczyzn posiadających TV:', len(men[men['owns_TV']==1]))
print('liczba rekordów meżczyzn posiadających dom:', len(men[men['owns_house']==1]))
print('liczba rekordów meżczyzn posiadających telefon:', len(men[men['owns_Phone']==1]))

liczba rekordów meżczyzn posiadających samochód: 0
liczba rekordów meżczyzn posiadających TV: 0
liczba rekordów meżczyzn posiadających dom: 0
liczba rekordów meżczyzn posiadających telefon: 349

In [ ]:
#Zadanie 4
#Stwórz ramkę danych, która zawierać będzie w pierwszej kolumnie wartość zmiennej COUNTRY, 
#w drugiej kolumnie, średnią posiadanych dóbr w danym kraju, 
#w trzeciej kolumnie minimum wieku, a czwartej kolumnie odsetek kobiet.

In [ ]:
#pytania dt zadania
#czy pierwsza kolumna ma zawierać tylko unikalne wartości tj 'A','B','C','D' czy te wartości mogą się powatarzać wielokrotnie dla 778 rekordów
#co rozumiemy przez średnią posiadanych dóbr? ciężko powórnywać sumę domu + telefon + tv ponieważ taka suma nic nie mówi o stanie posiadania właściciela
#tracimy tutaj wagi. Nieporównywalnie wiekszą wartość powinien miec dom niż np telefon
#w trzeciej kolumnie czy ma być to minimum wieku dla danego kraju czy np płci
#czy w czwartej kolumnie ma być odsetek kobiet w danym kraju

In [ ]:
#Założenia do zadania 4
#1 kolumna ma unikalne wartości A,B,C,D
#2 kolumna bedzie pokazywać średnią zsumownaych wartości dla danego rekordu tj (samochód+ dom+ telefon+ tv) z wagami 1. 
#czyli jesli ktoś ma tylko samochód to 1, a jeśli ma wszystkie dobra to 4
#3 kolumna to min wieku w danym kraju
#4 kolumna to odsetek kobiet do wszystkich osób w danym kraju

In [ ]:
# krok 1 tworzymy dodatkową kolumnę aby zsumować dobra dla danego rekordu (taka czynność była zrobiona dla zadania2 przy wersji nr 1 tego pliku)
df['wealth_quantity']=df['owns_car']+df['owns_TV']+df['owns_house']+df['owns_Phone']
df.head()

   ID Country  owns_car  owns_TV  ...  owns_Phone  gender Age  wealth_quantity
0   1       A       0.0      0.0  ...           1       M  61              1.0
1   2       B       0.0      0.0  ...           1       M  44              1.0
2   3       A       0.0      0.0  ...           1       M  56              1.0
3   4       A       0.0      0.0  ...           1       M  53              1.0
4   5       C       1.0      1.0  ...           1       K  60              3.0

[5 rows x 9 columns]

In [ ]:
# krok2 obliczamy wartości dla drugiej kolumny dla zadanych krajów
A = df[df['Country']=='A'] #filtrujemy tylko wiersze dla kraju A
B = df[df['Country']=='B']
C = df[df['Country']=='C']
D = df[df['Country']=='D']

A_Wealth = round(A['wealth_quantity'].mean(),2)
B_Wealth = round(B['wealth_quantity'].mean(),2)
C_Wealth = round(C['wealth_quantity'].mean(),2)
D_Wealth = round(D['wealth_quantity'].mean(),2)

Wealth = [A_Wealth, B_Wealth, C_Wealth, D_Wealth]
Wealth

[0.86, 1.46, 3.03, 4.0]

In [ ]:
# krok3 obliczamy min wieku w poszczególnych krajach
A_Age_Min = A['Age'].min()
B_Age_Min = B['Age'].min()
C_Age_Min = C['Age'].min()
D_Age_Min = D['Age'].min()

Age_Min = [A_Age_Min, B_Age_Min, C_Age_Min, D_Age_Min]
Age_Min

[18, 18, 18, 18]

In [ ]:
# krok4 obliczamy odsetek kobiet w danym kraju
A_Women = round((len(A[A['gender']=='K'])/len(A)) *100,2)
B_Women = round((len(B[B['gender']=='K'])/len(B)) *100,2)
C_Women = round((len(C[C['gender']=='K'])/len(C)) *100,2)
D_Women = round((len(D[D['gender']=='K'])/len(D)) *100,2)

Women_Percentage = [A_Women, B_Women, C_Women, D_Women]
Women_Percentage

[0.0, 63.78, 100.0, 100.0]

In [ ]:
# krok5 składamy DataFrame

Countries =['A','B','C','D']
Countires_Table_Dict= {'Countires':Countries, 'Wealth': Wealth, 'Age_Min': Age_Min, 'Women_Percentage':Women_Percentage}
Countries_Table = pd.DataFrame(Countires_Table_Dict)
Countries_Table

  Countires  Wealth  Age_Min  Women_Percentage
0         A    0.86       18              0.00
1         B    1.46       18             63.78
2         C    3.03       18            100.00
3         D    4.00       18            100.00